app/Models/ModelMahasiswa.php

    public function tampilData()
    {
        return $this->table('tb_mahasiswa')->get();
---
SELECT *
FROM `tb_mahasiswa`